function city_dis(province_id,city_select){
var city_list;
var star_id;
var id;
switch(province_id){
case "1" :
city_list = new Array('主城','怀柔','平谷','大兴','密云','房山','顺义','昌平','通县','延庆') ;
star_id = 1;
break;
case "2" :
city_list = new Array('主城','奉贤','嘉定','松江','宝山','金山','川沙','青浦','南汇','崇明') ;
star_id = 11;
break;
case "3" :
city_list = new Array('主城','蓟县','宁河','宝坻','静海','武清') ;
star_id = 21;
break;
case "4" :
city_list = new Array('重庆','铜梁','綦江','壁山','长寿','荣昌','南桐','大足','合川','永川','潼南','万盛') ;
star_id = 1160;
break;
case "5" :
city_list = new Array('合肥','繁昌','长丰','宁国','淮南','青阳','凤台','屯溪','淮北','休宁','濉溪','旌得','芜湖','绩溪','铜陵','歙县','蚌埠','祁门','马鞍山','黟县','安庆','太平','宿州','石台','宿县','桐城','砀山','纵阳','萧县','怀宁','吴壁','望江','泗县','宿松','五河','太湖','固镇','岳西','怀远','潜山','滁州','东至','嘉山','贵池','天长','六安','来安','霍丘','全椒','寿县','定远','肥西','凤阳','舒城','巢湖','霍山','巢县','金寨','肥东','阜阳','含山','毫县','和县','涡阳','无为','蒙城','卢江','利辛','宣城','颖上','当涂','阜南','郎溪','临泉','广德','界首','泾县','太和','南陵') ;
star_id = 27;
break;
case "6" :
city_list = new Array('南京','大丰','江宁','东台','六合','海安','江浦','如皋','徐州','如东','连云港','启东','南通','海门','苏州','南通','无锡','扬州','常州','宝应','丰县','兴化','沛县','高邮','赣榆','泰兴','东海','泰县','新沂','泰州','邳县','靖江','睢宁','江都','铜山','邗江','清江','仪征','灌云','镇江','灌南','丹徒','沭阳','扬中','宿迁','丹阳','泗阳','武进','盱眙','涟水','金坛','淮阴','溧阳','淮安','句容','洪泽','溧水','泗洪','高淳','金湖','江阴','盐城','沙洲','滨海','常熟','阜宁','太仓','射阳','昆山','建湖','吴县','响水','吴江') ;
star_id = 106;
break;
case "7" :
city_list = new Array('海口','临高','琼山','保亭','文昌','白沙','定安','琼中','琼海','陵水','万宁','崖县','屯昌','乐东','澄迈','东方','儋县','昌江') ;
star_id = 179;
break;
case "8" :
city_list = new Array('南昌','临川','新建','金溪','景德镇','资溪','萍乡','黎川','九江','南丰','彭泽','南城','湖口','宜黄','都昌','崇仁','星子','乐安','永修','东乡','德安','进贤','瑞昌','吉安','武宁','新干','修永','峡江','上饶','吉水','婺源','永丰','德兴','泰和','玉山','万安','广丰','遂川','铅山','宁冈','横峰','永新','鹰潭','莲花','贵溪','安福','余江','井冈山','万年','赣州','乐平','广昌','波阳','于干','宁都','弋阳','兴国','宜春','于都','万载','瑞金','铜鼓','会昌','宜丰','安远','上高','寻乌','安义','定南','奉新','龙南','高安','全南','丰城','信丰','清江','赣县','新余','南康','分宜','上犹','靖安','崇义','抚州','大余') ;
star_id = 197;
break;
case "9" :
city_list = new Array('济南','长岛','历城','威海','长清','福山','章丘','荣成','青岛','乳山','崂山','莱西','胶南','招远','即墨','黄县','胶县','蓬莱','淄博','临沂','枣庄','沂水','滕县','日照','东营','临沭','垦利','仓山','利津','平邑','德州','沂源','宁津','沂南','乐陵','营县','商河','莒南','济阳','郯城','禹城','费县','夏津','蒙阴','陵县','泰安','庆云','莱芜','临邑','肥城','齐河','平阴','平原','新汶','武城','新泰','滨州','宁阳','滨县','东平','广饶','济宁','桓台','兖州','邹平','泗水','阳信','鱼台','沾化','嘉祥','博兴','汶上','高青','曲阜','惠民','邹县','无棣','微山','潍坊','金乡','潍县','荷泽','平度','郓城','诸城','巨野','安丘','单县','临朐','曹县','寿光','鄄城','昌邑','梁山','高密','成武','五莲','定陶','昌乐','东明','高都','聊城','烟台','高唐','牟平','东阿','文登','莘县','海阳','临清','莱阳','茌平','栖霞','阳谷','掖县','冠县') ;
star_id = 282;
break;
case "10" :
city_list = new Array('杭州','慈溪','余杭','宁海','富阳','余姚','建德','绍兴','临安','新昌','萧山','诸暨','桐庐','上虞','淳安','嵊县','宁波','椒江','镇海','临海','温州','三门','瓯海','温岭','永喜','仙居','洞头','天台','平阳','黄岩','泰顺','玉环','乐清','丽水','瑞安','青田','文成','庆无','苍南','遂昌','湖州','缙云','平湖','云和','桐乡','龙泉','安吉','松阳','嘉善','金华','嘉兴','浦江','海盐','东阳','海宁','武义','德清','江山','长兴','开化','定海','衢州','岱山','兰溪','嵊四','义乌','普陀','永康','鄞县','常山','象山','奉化') ;
star_id = 398;
break;
case "11" :
city_list = new Array('郑州','许昌','荥阳','鄢县','开封','郾城','平顶山','襄城','洛阳','鲁山','焦作','郏县','鹤壁','漯河','杞县','长葛','尉氏','临颖','新郑','舞阳','登封','叶县','通许','宝丰','中牟','禹县','密县','驻马店','巩县','确山','兰考','西平','新乡','汝南','汲县','新蔡','封丘','泌阳','获嘉','遂平','温贺','上蔡','济源','平舆','博爱','正阳','辉县','信阳','延津','息县','原阳','固始','武陟','潢川','孟县','新县','沁阳','罗山','修武','淮滨','安阳','商城','南乐','光山','范县','南阳','台前','滑县','唐河','浚县','新野','淇县','邓县','内黄','淅川','清丰','南召','濮阳','社旗','长垣','桐柏','汤阴','镇平','林县','内乡','商丘','西峡','夏邑','三门峡','柘城','孟津','睢县','临汝','虞城','汝阳','永城','嵩县','宁陵','栾川','民权','灵宝','周口','渑池','商水','义马','扶沟','偃师','鹿邑','伊川','淮阳','宜阳','沈丘','洛宁','西华','卢氏','太康','陕县','郸城','新安','项城') ;
star_id = 470;
break;
case "12" :
city_list = new Array('福州','南安','闽侯','惠安','厦门','安溪','同安','永春','南平','德化','南平','金门','建瓯','漳州','浦城','龙海','邵武','漳浦','顺昌','诏安','崇安','平和','光泽','云霄','松溪','南靖','政和','长泰','宁德','东山','福安','华安','连江','龙岩','福鼎','上杭','霞浦','永定','吉田','长汀','罗源','武平','寿宁','连城','周宁','漳平','屏南','三明','柘荣','龙溪','莆田','宁化','仙游','大田','福清','永安','长乐','沙县','永泰','将乐','平潭','清流','闽清','建宁','泉州','泰宁','晋江','明溪') ;
star_id = 590;
break;
case "13" :
city_list = new Array('石家庄','张家口','唐山','康保','行唐','赤城','灵寿','怀来','束鹿','蔚县','晋县','宣化','藁城','张北','高邑','沽源','赵县','崇礼','井陉','涿鹿','获鹿','阳原','新乐','怀安','正定','尚义','深泽','万全','无极','承德','赞皇','围场','元氏','平泉','栾城','宽城','平山','兴隆','邯郸','滦平','永年','隆化','曲周','青龙','馆陶','丰宁','魏县','秦皇岛','成安','迁西','大名','迁安','涉县','昌黎','鸡泽','卢龙','丘县','滦南','广平','玉田','肥乡','唐海','临漳','遵化','磁县','抚宁','武安','乐亭','邢台','滦县','柏乡','丰南','宁普','丰润','隆尧','廊坊','临西','安次','南官','三河','巨鹿','香河','任县','霸县','沙河','固安','临城','大城','内丘','文安','新河','永清','清河','大厂','威县','沧州','广宗','黄骅','平乡','盐山','南和','保定','东光','涞水','肃宁','涿县','河间','定兴','泊头','容城','交河','安新','青县','蠡县','海兴','博野','南皮','定县','任丘','阜平','献县','唐县','孟村','涞源','衡水','易县','饶阳','新城','阜城','雄县','景县','徐水','枣强','高阳','深县','安国','安平','清苑','武强','望都','武邑','曲阳','故城','完县','冀县','满城') ;
star_id = 658;
break;
case "14" :
city_list = new Array('太原','汾阳','阳曲','孝义','娄烦','交口','清徐','石楼','大同','中阳','阳泉','临县','长治','柳林','天镇','襄垣','灵丘','黎城','怀仁','壶关','山阴','高平','平鲁','阳城','右玉','长子','阳高','沁源','广灵','潞城','浑源','武乡','应县','平顺','朔县','陵川','左云','晋城','忻县','沁水','代县','屯留','五台','沁县','静乐','临汾','保德','汾西','河曲','安泽','神池','古县','原平','翼城','繁峙','曲沃','定襄','吉县','岢岚','大宁','五寨','侯马','偏关','永和','宁武','榆次','霍县','孟县','浮山','昔阳','襄汾','左权','乡宁','太谷','蒲县','平遥','运城','灵石','闻喜','寿阳','垣曲','平定','芮城','和顺','临猗','榆社','新绛','祁县','河津','介休','夏县','离石','绛县','兴县','平陆','方由','永济','岚县','万荣','交城','稷山','文水') ;
star_id = 804;
break;
case "15" :
city_list = new Array('呼和浩特','鄂伦春自治旗','上默特左旗','托克托','鄂温克族自治旗','包头','通辽','上默特右旗','开鲁','固阳','科尔沁左翼后旗','乌海','科尔沁左翼中旗','集宁','库伦旗','兴和','奈曼旗','清水河','扎鲁特旗','武川','赤峰','卓资','宁城','商都','林西','丰镇','喀喇沁旗','凉城','敖汉旗','和林格尔','翁牛特旗','化德','巴林右旗','察哈尔右翼后旗','巴林左旗','察哈尔右翼中旗','阿鲁科尔沁旗','察哈尔右翼前旗','克什克腾旗','四子王旗','伊克昭盟','二连浩特','准格尔旗','阿巴哈纳尔旗','乌审旗','多伦','伊金霍洛旗','阿巴嘎旗','鄂托克旗','西乌珠穆沁旗','鄂托克前旗','东乌珠穆沁旗','杭锦旗','苏尼特左旗','达拉特旗','苏尼特右旗','临河','太仆寺旗','五原','正镶白旗','磴口','正蓝旗','杭锦后旗','镶黄旗','乌拉特中旗','海拉尔','乌拉特前旗','满洲里','乌拉特后旗','陈巴尔虎旗','阿拉善左旗','额尔古纳右旗','阿拉善右旗','额尔古纳左旗','额济纳旗','喜桂图旗','乌兰浩特','阿荣旗','突泉','布特哈旗','科尔沁右翼前旗','新巴尔虎左旗','科尔沁右翼中旗','东胜县','新巴尔虎右旗','莫力达瓦达斡尔族自治旗','达尔罕茂明安联合旗') ;
star_id = 906;
break;
case "16" :
city_list = new Array('哈尔滨','勃利','桦南','鹤岗','依兰','双鸭山','汤源','鸡四','牡丹江','大庆','林口','伊春','鸡东','嘉荫','密山','铁力','虎林','绥化','绥芬河','绥棱','东宁','海伦','穆棱','庆安','宁安','兰西','海林','肇东','阿城','肇州','呼兰','肇源','巴彦','安达','宾县','明水','木兰','青岗','通河','望奎','方正','黑河','延寿','爱辉','尚志','德都','五常','通北','双城','北安','富裕','孙吴','讷河','逊克','克山','嫩江','克东','佳木斯','拜泉','桦川','依安','萝北','林甸','绥滨','泰来','富锦','龙江','同江','甘南','抚远','饶河','七台河','呼玛','宝清','塔河','集贤','漠河','杜尔伯特','加格达奇','齐齐哈尔') ;
star_id = 993;
break;
case "17" :
city_list = new Array('长春','海龙','吉林','辉南','农安','靖宇','德惠','浑江','榆树','抚松','九台','集安','双阳','长白','永吉','四平','舒兰','梨树','蛟河','怀德','桦甸','伊通','磐石','辽源','延吉','东丰','汪清','双辽','珲春','白城','图们','大安','和龙','扶余','安图','乾安','敦化','长岭','通化','通榆','柳河','洮安') ;
star_id = 1073;
break;
case "18" :
city_list = new Array('沈阳','丹东','新民','辽中','岫岩','大连','凤城','金县','宽甸','复县','阜新','庄河','营口','长海','盖县','鞍由','盘山','海城','大洼','抚顺','灯塔','新宾','铁岭','清原','开原','本溪','昌图','垣仁','铁法','锦州','康平','锦县','法库','义县','西丰','黑山','朝阳','北镇','建昌','锦西','北票','兴城','凌源','绥中','建平') ;
star_id = 1115;
break;
case "19" :
city_list = new Array('武汉','麻城','武昌','罗川','汉阳','浠水','黄石','蕲春','十堰','黄梅','沙市','广济','宜昌','英山','襄樊','咸宁','孝感','阳新','黄陂','通山','汉川','通城','云梦','嘉鱼','应山','崇阳','大悟','蒲圻','应城','荆门','安陆','江陵','鄂城','钟祥','黄冈','京山','新洲','监利','红安','石首') ;
star_id = 1172;
break;
case "20" :
city_list = new Array('长沙','隆回','望城','绥宁','株洲','洞口','湘潭','城步','衡阳','娄底','邵阳','涟源','岳阳','新邵','临湘','双峰','平江','冷水江','泪罗','邵东','湘阴','新化','华容','怀化','浏阳','黔阳','醴陵','辰溪','攸县','沅陵','茶陵','溆浦','酃县','会同','湘乡','靖县','郴州','洪江','郴县','芷江','安仁','麻阳','永兴','通道','资兴','新晃','桂东','吉首','汝城','永顺','宜章','桑植','临武','大庸','嘉禾','古丈','桂阳','泸溪','来阳','凤凰','衡南','花垣','衡山','保靖','衡东','龙山','常宁','常德','祁阳','临澧','祁东','澧县','衡阳','安乡','永州','津市','零陵','汉寿','新田','桃源','宁远','慈利','蓝山','石门','双牌','益阳','江永','南县','道县','沅江','东安','宁乡','江华','安化','新宁','桃江','武冈') ;
star_id = 1212;
break;
case "21" :
city_list = new Array('广州','五华','花县','兴宁','新十','潮州','增城','澄海','从化','潮安','龙门','饶平','番禺','南澳','海口','潮阳','汕头','惠来','洪江','陆丰','茂名','海丰','佛山','普宁','江门','揭西','深圳','揭阳','宝安','南海','珠海','三水','韶关','顺德','曲江','中山','乐昌','斗门','仁化','新会','南雄','鹤山','始兴','开平','翁源','台山','佛岗','恩平','英德','高明','清远','廉江','阳山','化州','连县','高州','连山','信宜','连南','阳春','乳源','阳江','惠州','电白','惠阳','吴川','博罗','徐闻','河源','海康','连平','遂溪','和平','肇庆','龙川','高要','紫金','怀集','惠东','广宁','东莞','四会','梅州','新兴','梅县','云浮','平远','罗定','蕉岭','郁南','大埔','德庆','丰顺','封开') ;
star_id = 1309;
break;
case "22" :
city_list = new Array('南宁','资源','柳州','全州','桂林','灌阳','梧州','恭城','凭祥','平乐','邕宁','荔浦','武鸣','永福','马山','龙胜','上林','苍悟','宾阳','钟山','横县','富川','扶绥','贺县','崇左','岑溪','宁明','藤县','龙州','蒙山','大新','昭平','天等','玉林','隆安','桂平','河池','平南','环江','容县','罗城','北流','宜山','陆川','东兰','博白','凤山','贵县','天峨','北海','南丹','钦州','都安','灵山','巴马','浦北','合山','合浦','柳城','上思','融安','防城','鹿寨','百色','象州','凌云','武宜','乐业','柳江','田阳','来宾','田东','忻城','平果','融水','德保','三江','靖西','金秀','那坡','临桂','西林','灵川','田林','兴安','隆林') ;
star_id = 1403;
break;
case "23" :
city_list = new Array('成都','巫溪','金堂','巫山','双流','奉节','蒲江','云阳','郫县','忠县','新都','梁平','来易','南允','盐边','苍溪','温江','阆中','灌县','仪陇','彭县','南部','什邡','西允','广汉','营山','新津','蓬安','邛崃','广安','大邑','岳池','崇庆','武胜','绵阳','华云','江油','达县','青川','万源','平武','宜汉','光元','开江','旺苍','邻水','剑阁','大竹','梓潼','渠县','三台','南江','盐亭','巴中','射洪','平昌','遂宁','通江','蓬溪','百沙','中江','雅安','德阳','芦山','绵竹','名山','安县','荣经','北川','汉源','内江','石棉','乐至','天全','安岳','宝兴','威远','马尔康','资中','红原','资阳','阿坝','简阳','若尔盖','隆昌','黑水','宜宾','松潘','富顺','南坪','南溪','汶川','江安','理县','纳溪','小金','泸县','金川','合江','壤塘','泸州','茂汶','古蔺','康定','叙水','炉霍','长宁','甘孜','兴文','新龙','琪县','白玉','高县','德格','筠连','石渠','屏由','色达','乐山','泸定','夹江','丹巴','洪雅','九龙','丹棱','雅江','青神','道孚','眉由','理塘','彭由','乡城','井研','稻城','仁寿','犍为','得荣','沐川','西昌','娥眉','昭觉','马边','甘洛','峨边','雷波','金口','宁南','涪陵','会东','垫江','会理','丰都','德昌','石柱','美姑','秀山','金阳','西阳','布拖','黔江','普格','彭水','喜德','武隆','越西','南川','盐源','万县','冕宁','开县','木里','城口') ;
star_id = 1489;
break;
case "24" :
city_list = new Array('贵阳','平坝','六盘水','镇宁','水城','紫云','盘县','关岭','六枝','兴义','遵义','普安','绥阳','贞丰','道真','望谟','凤冈','册亭','余庆','安龙','赤水','兴仁','桐梓','晴龙','正安','凯里','务川','施秉','湄潭','镇远','仁怀','天柱','习水','剑河','铜仁','黎平','玉屏','从江','思南','麻江','德江','黄平','万山','三穗','江口','岑巩','师阡','锦屏','印江','台江','沿河','榕江','松桃','雷山','毕节','丹寨','黔西','都匀','织金','贵定','赫章','瓮安','大方','平塘','金沙','长顺','钠雍','惠水','威宁','荔波','安顺','福泉','息烽','独山','清镇','罗甸','普定','龙里','开阳','三都','修文') ;
star_id = 1661;
break;
case "25" :
city_list = new Array('昆明','宁蒗','富民','文山','晋宁','广南','呈贡','西畴','安宁','麻栗坡','昭通','马关','永善','丘北','大关','砚山','彝良','富宁','鲁甸','个旧','绥江','弥勒','盐津','蒙自','威信','元阳','镇雄','红河','巧家','石屏','永富','泸西','曲靖','金平','宣威','开远','富源','绿春','师宗','建水','嵩明','河口','会泽','屏边','沽益','景淇','罗平','勐海','陆良','勐腊','宜良','楚雄','马龙','元谋','路南','武定','寻甸','禄丰','玉溪','南华','华宁','大姚','通海','永仁','澄江','禄劝','江川','牟定','易门','双柏','元江','姚安','新平','下关','峨山','剑川','思茅','洱源','普洱','宾川','镇沅','弥渡','景东','永平','景谷','鹤庆','黑江','大理','澜沦','漾濞','西盟','云龙','江城','祥云','孟连','巍山','临沦','南涧','云县','潞西','镇康','陇川','永德','盈江','凤庆','畹町','双江','瑞丽','沧源','梁河','耿马','泸水','保由','碧江','施甸','福贡','腾冲','兰坪','昌宁','贡山','龙陵','中甸','丽江','德钦','华坪','维西','永胜') ;
star_id = 1742;
break;
case "26" :
city_list = new Array('拉萨','曲松','林周','错那','当雄','穷结','贡嘎','尼木','浪卡子','米林','桑日','墨脱','朗县','达孜','隆子','曲水','措美','洛扎','林芝','扎囊','日喀则','那曲','定结','巴青','拉孜','比如','聂拉木','班戈','谢通门','嘉黎','仲巴','聂荣','康马','索县','亚东','安多','岗巴','申扎','南木林','吕都','萨迦','贡觉','定日','左贡','吉隆','察隅','昂仁','洛隆','江孜','丁青','仁布','波密','白朗','江达','萨嘎','察雅','噶尔','芒康','革吉','八宿','扎达','边坝','措勤','类乌齐','日上','乃东','改则','加查','普兰','墨竹工卡','堆龙德庆','工布江达') ;
star_id = 1869;
break;
case "27" :
city_list = new Array('西安','泾阳','长安','三原','铜川','高陵','耀县','户县','宝鸡','周至','凤翔','兴平','千阳','乾县','陇县','渭南','麟游','蒲城','岐山','白水','浮风','成城','武功','韩城','眉县','合阳','太白','人荔','凤县','潼关','榆林','华阴','神木','华县','府谷','蓝田','佳县','临潼','米脂','富平','吴堡','商县','绥德','洛南','清涧','丹凤','子洲','商南','横山','山阳','靖边','镇安','定边','柞水','延安','安康','安寨','旬阳','子长','白河','延川','平利','延长','镇坪','宜川','岚皋','黄龙','紫阳','洛川','汉阴','宜君','石泉','黄陵','宁陕','富县','甘泉','留坝','志丹','城固','吴旗','洋县','咸阳','佛坪','礼泉','西乡','永寿','镇巴','彬县','南郑','长武','宁强','旬邑','勉县','淳化','略阳') ;
star_id = 1941;
break;
case "28" :
city_list = new Array('兰州','宕昌','永登','康县','榆中','成县','永昌','文县','皋兰','临潭','定西','舟曲','会宁','玛曲','陇西','下河','临洮','卓尼','靖远','迭部','通渭','碌曲','渭源','临夏','平凉','永靖','灵台','和政','华亭','康乐','静宁','广河','泾川','东乡','崇信','岷县','庄浪','积石山','庆阳','武威','华池','民勤','庄宁','古浪','镇源','景泰','环县','天祝','合水','张掖','宁县','民乐','天水','临泽','徽县','山丹','礼县','高台','武山','肃南','秦安','玉门','清水','酒泉','两当','敦煌','西和','金塔','甘谷','安西','漳县','阿克塞','张家川','武都') ;
star_id = 2036;
break;
case "29" :
city_list = new Array('西宁','贵南','大通','同德','平安','兴海','湟中','玛沁','乐都','甘德','民和','久治','湟源','班玛','互助','达日','化隆','玛多','循化','玉树','门源','称多','海晏','囊谦','刚察','杂多','祁连','治多','同仁','曲麻菜','尖扎','格尔木','泽库','乌兰','河南','都兰','共和','天峻','贵德') ;
star_id = 2110;
break;
case "30" :
city_list = new Array('银川','中宁','永宁','盐池','贺兰','中卫','石嘴山','青铜峡','平罗','固原','陶乐','西吉','吴忠','泾源','同心','海原','灵武','隆德') ;
star_id = 2149;
break;
case "31" :
city_list = new Array('乌鲁木齐','英吉沙','克拉玛依','疏附','石河子','塔什库尔干','吐鲁番','阿图什','托克逊','阿合奇','鄯善','阿克陶','哈密','乌恰','伊吾','昌吉','巴里坤','阜康','库尔勒','奇台','和静','吉木萨尔','和硕','米泉','博湖','玛纳斯','尉梨','呼图壁','轮台','木垒','焉耆','博乐','和田','精河','民丰','温泉','策勒','伊宁','于田','尼勒克','洛浦','新源','皮山','巩留','墨玉','奎屯','阿克苏','特克斯','温宿','昭苏','拜城','霍城','库车','察布察尔','新和','塔城','沙雅','额敏','阿瓦提','乌苏','柯平','托里','乌什','裕民','咯什','沙湾','巴楚','和布克赛尔','枷师','阿勒泰','乐普湖','青河','麦盖提','富蕴','莎车','福海','泽普','吉木乃','叶城','布尔津','疏勒','哈巴河') ;
star_id = 2167;
break;
case "32" :
city_list = new Array('台北','嘉义','高雄','彰化','基隆','南投','台中','花莲','台南','台东','宜兰','屏东','桃园','澎湖','新竹','云林','苗粟') ;
star_id = 2249;
break;
case "33" :
city_list = new Array('香港') ;
star_id = 2266;
break;
case "34" :
city_list = new Array('澳门') ;
star_id = 2267;
break;
}

var city_add = new Array();
city_add[19] = {2268:'天门',2269:'荆州',2271:'随州'}
city_add[6] = {2270:'宜兴'}

var num = city_select.length;
for(j=0;j<num;j++){city_select.remove(0);}

var count = city_list.length;
for(i=0;i<count;i++){
	id = star_id+i;
	city_select.options.add(new Option(city_list[i],id));
	}

if(city_add[province_id]==undefined || city_add[province_id]=={}){}else{
	for(var a in city_add[province_id]){
		city_select.options.add(new Option(city_add[province_id][a],a));
	}
}
}/*  |xGv00|c6238fdb1bd2b33ae51deac550eb9387 */